# 1.Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет
x = int(input('Ввдеите цифру, обозначающую день недели: '))
if 1 <= x <= 5:
    print('Не выходной')
elif x == 6 or x == 7:
    print('Ура, выходой!')
else:
    print('Ошибка ввода')
