# Напишите программу, которая принимает на вход координаты двух точек
# и находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21

A1 = int(input('Введите координаты А1: '))
A2 = int(input('Введите координаты А2: '))
B1 = int(input('Введите координаты B1: '))
B2 = int(input('Введите координаты B2: '))
AB = ((A2 - A1)**2 + (B2 - B1)**2)**0.5
print(f"A ({A1},{A1}); B ({B2},{B2}) -> {AB}")